<script setup lang="ts">
</script>
<style>
  @import '../assets/landing.css';
</style>

<template>
  <div class="landing-page">
    <div class="landing-image-block">
      <h1>
        <span class="kid-font">kid</span>
        <span>TASK</span>
      </h1>
      <p>Кто вы?</p>
      <!--<div class="landing-button-block">
        <button>Ребенок</button>
        <button>Родитель</button>
      </div>-->
      <div class="landing-button-block">
        <router-link to="/child/login" class="landing-button">Ребенок</router-link>
        <router-link to="/parent/login" class="landing-button">Родитель</router-link>
      </div>
</div>

    <div class="about">
      <h2>О нас</h2>
      <p>
        KidTASK — сервис геймификации домашних обязанностей и система финансового воспитания для детей.
      </p>
      <p>
        Родителям сложно мотивировать детей выполнять домашние обязанности - приходится постоянно напоминать и контролировать. Дети не видят связи между усилием и крупной целью,
        хотят результат сразу и не умеют откладывать ради желаемого. Это приводит к конфликтам в семье, импульсивному потреблению и слабой финансовой дисциплине в будущем.
        Существующие решения не закрывают эту боль: карманные деньги не привязаны к целям, банковские детские карты учат тратить, а не копить, трекеры задач не связывают усилия с
        конкретной целью ребенка. Цель — создать сервис, который формирует у ребёнка связь: усилие → накопление → достижение цели → реальное вознаграждение, снижая нагрузку на родителей
        и превращая домашние обязанности в инструмент достижения собственных желаний.
      </p>
      <p>
        KidTASK — единственный сервис который связывает домашние обязанности с конкретной целью ребёнка. Трекеры задач, детские банковские карты и абстрактная геймификация решают проблему
        частично - мы объединяем всё в одну прозрачную модель: задача → начисление валюты → накопление → реальная покупка. Ребёнок сам создаёт цель, она становится его личной мотивацией —
        обязанности перестают быть навязанными. Родитель задаёт стоимость цели и полностью контролирует процесс без доступа к реальным деньгам, что исключает риск импульсивных трат.
        Вместо конфликта «купи» → «нет» появляется вопрос «сколько осталось накопить?». В отличие от конкурентов которые работают через мелкие ежедневные бонусы, мы строим механику
        отложенного вознаграждения — ключевой навык финансовой зрелости.
      </p>
    </div>
  </div>
</template>
